{
  "session_info": {
    "id": "926-mob",
    "name": "MOB - Beam Charge and Current Monitors",
    "url": "https://meow.elettra.eu/90/session/926-mob/index.html",
    "prefix": "MOB"
  },
  "papers": [
    {
      "paper_id": "MOBC01",
      "title": "Measurement of nanoampere beam intensities at FAIR1Like standard beam transformers the cryogenic current comparator",
      "authors": [
        "Schwickert",
        "T. Sieber",
        "Zakosarenko",
        "Stoehlker",
        "H. Braeuning",
        "Voss",
        "Tympel",
        "T. Koettig",
        "Crescimbeni",
        "Tan"
      ],
      "institutions": [
        "GSI Helmholtz Centre for Heavy Ion ResearchL",
        "European Organization for Nuclear ResearchS",
        "GSI Helmholtz Centre for Heavy Ion Research",
        "Leibniz Institute of Photonic Technology",
        "Ernst Abbe University of Applied Sciences Jena",
        "Helmholtz Institute Jena"
      ],
      "abstract": "(CCC) measures the intensity of particle beams via the azimuthal magnetic field. The superior performance of the CCC derives from a superconducting magnetometer (SQUID - Superconducting Quantum Interference Device), which detects fields in the fT range. This enables for current resolution in the nA range but in return needs extremely careful protection from external influences like stray fields and mechanical vibrations. The CCC therefore requires an elaborated superconducting magnetic shielding and is housed in a specially developed, vibration damped He bath cryostat. We have recently achieved half a year of non-stop operation in stand-alone (closed Helium circuit) mode. The nA resolution has been demonstrated earlier during several beamtimes, in CRYRING as well as with slow extracted beams from SIS18. Among the CCC types, which have been investigated, the 'Dual Core' (DCCC) version showed the best performance with respect to bandwith and current resolution. The DCCC and its cryostat therefore mark a provisional closure of CCC development for FAIR. In this contribution we present the latest results and system status., , M. . , Friedrich Schiller University Jena; GSI Helmholtz Centre for Heavy Ion Research, Friedrich Schiller University JenaT. ; GSI Helmholtz Centre for Heavy Ion Research; Institute for Optics and Quantum Electroncs, GSI Helmholtz Centre for Heavy Ion Research, Helmholtz Institute Jena, Institute for Optics and Quantum ElectroncsV. , GSI Helmholtz Centre for Heavy Ion Research, Helmholtz Institute Jena; GSI Helmholtz Centre for Heavy Ion ResearchR. Stolz  Technische Universität Ilmenau, Leibniz Institute of Photonic Technology, Leibniz Institute of Photonic Technology; Technische Universität IlmenauV. , Leibniz Institute of Photonic Technology; supracon AG, supracon AGG. Khatri, , J. . Kolbe, B.  10.18429/JACoW-IBIC2025-MOBC01 01 Sep 2025 —  —  —",
      "pdf_url": "https://meow.elettra.eu/90/pdf/MOBC01.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-MOBC01",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": true
    },
    {
      "paper_id": "MOBC02",
      "title": "Performance study of Fast Beam Current Transformer calibration in the LHC7Fast Beam Current Transformers (FBCTs) are",
      "authors": [
        "D. Alves",
        "Lasocha",
        "M. Gasior"
      ],
      "institutions": [
        "European Organization for Nuclear Research"
      ],
      "abstract": "essential devices for measuring bunched beam intensities in the Large Hadron Collider (LHC). A cross-calibration of these devices against DC Beam Current Transformers (DC-BCTs) is used in the LHC ring, but this method relies on assumptions that introduce inaccuracies. FBCTs are also used in the LHC transfer lines, where DC-BCTs are unavailable, making absolute calibration crucial for transmission studies. To allow absolute calibration, the FBCTs are equipped with a pulsed current source to perform a calibration before each fill. However, a systematic underestimation in the calculated scaling factors has been observed when comparing them to the cross-calibration with the DC-BCTs. This work characterizes the calibrator performance, evaluates different algorithms for calculating the scaling factors and reports on issues found linked to processing chain modeling inaccuracies, ghost/satellite bunches, and the FPGA-based digital integration. A revised model of the processing chain improved calibration accuracy by 0.4%, while an initial test of a batch-by-batch baseline in the digital integration seems to explain the remaining 3% underestimation.J. Marafuz Gaspar  Instituto Superior Técnico, European Organization for Nuclear ResearchT. Levens, , , K.  10.18429/JACoW-IBIC2025-MOBC02 03 Sep 2025 —  —  —",
      "pdf_url": "https://meow.elettra.eu/90/pdf/MOBC02.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-MOBC02",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": true
    },
    {
      "paper_id": "MOBI01",
      "title": "Transverse Momentum Measuring Systems: The Cryogenic Momentatron and the TESS12Photocathode performance optimization is",
      "authors": [
        "Churn",
        "G. Adhikari",
        "W. Schroeder  University",
        "Vecchione"
      ],
      "institutions": [
        "Science and Technology Facilities Council",
        "SLAC National Accelerator LaboratoryI"
      ],
      "abstract": "crucial to the operation of X-ray Free Electron Laser (FEL) facilities such as LCLS-II and the future UK XFEL as the initial photoelectron phase-space distribution directly impacts x-ray generation efficiency in the undulator. Key photocathode parameters such as transverse emittance and quantum efficiency are routinely measured to monitor and improve performance; metrics that are influenced by the photocathode material, operating temperature, vacuum and RF environmental conditions, and the characteristics of laser illumination (e.g., wavelength, and pulse energy, duration, and repetition rate). To better understand these factors, SLAC has developed a laboratory-based cryogenic Momentatron system to measure the emission properties of photocathodes from 30 K to 300 K using 200-800 nm wavelength-tunable light. The system’s design and initial commissioning performance have been validated through simulations and error analysis, confirming its reliability for photocathode characterization. We present measurements taken at SLAC, along with complementary data for Cs-Te obtained using the TESS system at Daresbury Laboratory - a similar photocathode characterization tool. These results provide valuable insights into photoemission physics that may be leveraged to optimize photocathode performance and thus that of X-ray FELs., T. . Shan,  of Illinois ChicagoL. Jones, H.  10.18429/JACoW-IBIC2025-MOBI01 03 Sep 2025 —  —  —",
      "pdf_url": "https://meow.elettra.eu/90/pdf/MOBI01.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-MOBI01",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": true
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-09-29 19:50:27"
}