{
  "session_info": {
    "id": "882-tuc",
    "name": "TUC - Special Talks / Machine Parameter Measurements",
    "url": "https://meow.elettra.eu/90/session/882-tuc/index.html",
    "prefix": "TUC"
  },
  "papers": [
    {
      "paper_id": "TUCC01",
      "title": "Novel method for real-time temperature monitoring of isotope production targetsThe extraction of radioactive ion beams",
      "authors": [
        "B. Cheal",
        "L. Backes",
        "M. Pearson  University",
        "M. Fatouros",
        "A. Laxdal",
        "F. Ames",
        "D. Joseph",
        "P. Kunz"
      ],
      "institutions": [],
      "abstract": "(RIB) from proton bombardment on Isotope Separation On-Line (ISOL) production targets depends on the optimization of multiple parameters. Proton beam intensity, the position and shape of the proton beam onto the target are important factors. Crucial for the efficient release of radioactive isotopes from a target are peak temperatures up to 2300 C and temperature gradients within. Since ISOL targets operate in a hard radiation environment conventional temperature diagnostics are not feasible. We have developed an optical system for remote temperature measurements in ISOL targets. It detects the emitted light of the hot target from a distance and correlates near infrared emissions (NIR) to temperature. The device includes a set of optics that transports the light to a NIR spectrometer, and the calculated target temperature is integrated into EPICS and MIDAS frameworks. The strength of the method is that no prior knowledge of the emissivity is required. The diagnostic guides on-line RIB delivery and supports R&D activities to optimize RIB production. Details of the device and measurements will be reported., , , J. lassen, , ,   TRIUMFA. Wolski, ,  of Liverpool",
      "pdf_url": "https://meow.elettra.eu/90/pdf/TUCC01.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-TUCC01",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": false
    },
    {
      "paper_id": "TUCPD01",
      "title": "Breaking Boundaries: Innovation and Inclusion in Instrumentation ScienceThis contribution will reflect on Professor",
      "authors": [
        "J. Bell Burnell  University"
      ],
      "institutions": [],
      "abstract": "Bell-Burnell's career, spanning decades of groundbreaking work in astrophysics, from the discovery of pulsars to leadership in the global scientific community. Along the way, she has received numerous prestigious awards, including the Special Breakthrough Prize in Fundamental Physics, the Royal Astronomical Society Gold Medal, and the President’s Medal of the Institute of Physics, recognizing her outstanding contributions to science and beyond. Professor Bell-Burnell has worked as an observer in gamma ray, X-ray, IR and millimetre and radio astronomy and will describe each phase briefly. Beyond the science, Professor Dame Bell-Burnell will explore the importance of promoting equality, diversity, and inclusion (EDI) in STEM, drawing on her experiences to highlight how fostering an inclusive environment strengthens innovation and career development. **Speaker: Prof Dame Jocelyn Bell-Burnell** of Oxford",
      "pdf_url": "https://meow.elettra.eu/90/pdf/TUCPD01.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-TUCPD01",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-09-29 19:52:50"
}