{
  "session_info": {
    "id": "874-thb",
    "name": "THB - Longitudinal Diagnostics and Synchronization / Special Talks / Closing Session",
    "url": "https://meow.elettra.eu/90/session/874-thb/index.html",
    "prefix": "THB"
  },
  "papers": [
    {
      "paper_id": "THBC01",
      "title": "High-performance bunch arrival time monitors with fs precision at DESY832Pump-probe experiments at Free-Electron Laser facilities depend heavily on the relative timing precision of the pump and the probe, which determines the resolution of the observed ultrafast phenomena. The DESY's Bunch Arrival Time Monitors (BAM) are state-of-the-art sensors based on an electro-optical detection principle, that delivers information on the bunch timing with unprecedented femtosecond-level precision. Timing synchronization at machine level is achieved through a complex system of arrival time sensors, stabilized optical distribution, and feedback controls. Major advances in the performance, construction, and operation of the BAMs are discussed in detail. Integration of the sensor into the synchronization system, and important global optimization and interplay are mentioned as well. These improvements enabled a synchronization of the electron beam with a world-leading precision of less than 3fs at European XFEL.J. Kral, M. Büchler, J. Georg, J. Roever, M. Czwalinna  Deutsches Elektronen-Synchrotron DESYPaper:",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "pdf_url": "https://meow.elettra.eu/90/pdf/THBC01.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-THBC01",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": true
    },
    {
      "paper_id": "THBI01",
      "title": "Positronium Laser Cooling: A Science Highlight and Instrumentation ChallengesThe successful laser cooling of positronium (Ps) via the 1$^3$S – 2$^3$P transition using broadband laser pulses, recognized as a Physics World Top 10 breakthrough in 2024, marked a milestone in antimatter research. Ps, a bound state of a positron and electron, posed significant challenges due to its 142 ns lifetime and broad Doppler profile. Achieved by the AEgIS collaboration at CERN, this breakthrough relied on precise positron beam control from a Surko-style buffer gas trap, nano-engineered positron-to-positronium converters, and advanced detection systems. This contribution highlights the instrumentation challenges underlying this success, including stabilizing and fine-tuning the positron beam with advanced magnetic and electrostatic confinement, nanosecond-level synchronization of laser pulses, and high-resolution, low-noise detection systems. These developments enabled positronium cooling and laid the groundwork for precision antimatter studies, underscoring the critical role of beam stability, timing, and diagnostics in fundamental physics.B. Rienäcker  University of Liverpool",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "pdf_url": "https://meow.elettra.eu/90/pdf/THBI01.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-THBI01",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": false
    },
    {
      "paper_id": "THBIBIC26",
      "title": "IBIC 2026",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "pdf_url": "https://meow.elettra.eu/90/pdf/THBIBIC26.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-THBIBIC26",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-09-29 18:41:14"
}