{
  "session_info": {
    "id": "887-wec",
    "name": "WEC - Transverse Profile and Emittance Monitors / Machine Parameter Measurements",
    "url": "https://meow.elettra.eu/90/session/887-wec/index.html",
    "prefix": "WEC"
  },
  "papers": [
    {
      "paper_id": "WECC01",
      "title": "Minimally Invasive Nano-Fabricated Wire Scanner for FEL OperationsAt the Paul Scherrer Institute (PSI), a minimally",
      "authors": [
        "A. Gobbo",
        "S. Reiche",
        "E. Prat",
        "G. Orlandi",
        "Guzenko",
        "R. Ischebeck",
        "F. Addesa",
        "A. Foskolos",
        "P. Dijkstal"
      ],
      "institutions": [
        "Paul Scherrer Institute"
      ],
      "abstract": "invasive wire scanner with sub-micrometer spatial resolution has been developed with a twofold objective: enabling real-time monitoring of the SwissFEL (Free Electron Laser) electron beam transverse size during lasing operation while also paving the way for a new generation of customizable wire scanners. These scanners are designed to be suitable for low and ultra-low emittance beams highly demanded by FEL developments and advanced acceleration concepts. Building on previous experience, nanotechnology has been further explored, utilizing photolithography to fabricate low-stress silicon nitride (Si₃N₄) wires suspended on a C-shaped silicon fork. Each fork hosts two perpendicular wires, allowing for the reconstruction of the beam profile in both the x and y directions. The wires are 2,4 and 6 µm wide and only 200 nm thick, and their length is tailored to match the SwissFEL beam clearance. Several prototypes have been successfully produced and installed at SwissFEL. This work presents the wire scanner's design and fabrication process, along with initial beam measurements at SwissFEL under lasing operations at 10 pC., , , , , , , , V.",
      "pdf_url": "https://meow.elettra.eu/90/pdf/WECC01.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-WECC01",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": false
    },
    {
      "paper_id": "WECI01",
      "title": "Machine Learning-based beam sculpting and measurement using a multileaf collimator and emittance exchange",
      "authors": [
        "Majernik"
      ],
      "institutions": [
        "SLAC National Accelerator Laboratory"
      ],
      "abstract": "This paper presents a novel, rapidly reconfigurable multileaf collimator (MLC) for high-fidelity beam shaping. The MLC, compatible with ultra-high vacuum, features independently actuated leaves to tailor mask profiles. Coupled with an emittance-exchange (EEX) beamline at the Argonne Wakefield Accelerator, transverse profiles are transformed into custom longitudinal distributions, including ramped beams. We demonstrate various measurements of tailored beam profiles, both transverse and longitudinal. A new, rotor-based design increases flexibility, and a feed-forward control algorithm enables on-demand shaping. Machine learning optimizes MLC degrees of freedom for applications like FEL gain or wakefield accelerator performance, and adapts beam parameters in real-time to changing accelerator conditions. This versatile beam sculpting instrument has broad relevance for next-generation accelerators across FEL, AAC, and hadron-beam communities.N.",
      "pdf_url": "https://meow.elettra.eu/90/pdf/WECI01.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-WECI01",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": false
    },
    {
      "paper_id": "WECI02",
      "title": "Experimental demonstration of a single-shot, nondestructive electron beam diagnostic based on the ionization of a",
      "authors": [],
      "institutions": [],
      "abstract": "low-density pulsed gas jet7 MeV electron bunches from a radiofrequency photoinjector, carrying up to 100 pC of charge, traversed a localized distribution of nitrogen gas (N2). The interaction of the electron bunches with the N2 gas generated a correlated signature in the ionized particle distribution, which was spatially magnified using a series of electrostatic lenses and recorded with a microchannel-plate detector. Various modalities, including point-to-point imaging and velocity mapping, are investigated. A temporal trace of the detector current enabled the identification of single- and double-ionization events. The characteristics of the ionization distribution, dependence on gas density, total bunch charge, and other parameters, are described. Approaches to scaling to higher electron bunch density and energy are suggested. Additionally, the instrument proves useful for comprehensive studies of the ionization process itself.P. Denham  Particle Beam Physics Lab",
      "pdf_url": "https://meow.elettra.eu/90/pdf/WECI02.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2025-WECI02",
      "received_date": "",
      "accepted_date": "",
      "page_number": "",
      "pdf_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-09-29 19:55:09"
}